tests/performance/load-baseline.config.yml
config:
  target: "{{ $env.BASE_URL }}"
  http:
    timeout: 30
  phases:
    - name: warm-up
      duration: 60
      arrivalRate: 3
      maxVusers: 20
    - name: sustained
      duration: 300
      arrivalRate: 15
      maxVusers: 50
  plugins:
    publish-metrics:
      - type: cloudwatch
        region: "{{ $env.AWS_REGION }}"
        namespace: flex/performance-tests
        dimensions:
          - name: Stage
            value: "{{ $env.STAGE }}"
          - name: TestType
            value: load-baseline
        traces:
          serviceName: flex-api
          sampleRate: 1
          useRequestNames: true
          annotations:
            tool: Artillery
            stage: "{{ $env.STAGE }}"
            testType: load-baseline