tests/performance/load-growth.config.yml
config:
  target: "{{ $env.BASE_URL }}"
  http:
    timeout: 30
  phases:
    - name: ramp
      duration: 120
      arrivalRate: 15
      rampTo: 50
      maxVusers: 100
    - name: sustained
      duration: 300
      arrivalRate: 50
      maxVusers: 150
  plugins:
    publish-metrics:
      - type: cloudwatch
        region: "{{ $env.AWS_REGION }}"
        namespace: flex/performance-tests
        dimensions:
          - name: Stage
            value: "{{ $env.STAGE }}"
          - name: TestType
            value: load-growth
        traces:
          serviceName: flex-api
          sampleRate: 1
          useRequestNames: true
          annotations:
            tool: Artillery
            stage: "{{ $env.STAGE }}"
            testType: load-growth