tests/performance/smoke-cloudwatch.config.yml
config:
  target: "{{ $env.BASE_URL }}"
  phases:
    - duration: 15
      arrivalRate: 1
      maxVusers: 1
  plugins:
    publish-metrics:
      - type: cloudwatch
        region: "{{ $env.AWS_REGION }}"
        namespace: flex/performance-tests
        dimensions:
          - name: Stage
            value: "{{ $env.STAGE }}"
        traces:
          serviceName: flex-api
          sampleRate: 1
          useRequestNames: true
          annotations:
            tool: Artillery
            stage: "{{ $env.STAGE }}"