tests/performance/soak.config.yml
config:
  target: "{{ $env.BASE_URL }}"
  http:
    timeout: 30
  phases:
    - name: soak
      duration: 1800
      arrivalRate: 15
      maxVusers: 50
  plugins:
    publish-metrics:
      - type: cloudwatch
        region: "{{ $env.AWS_REGION }}"
        namespace: flex/performance-tests
        dimensions:
          - name: Stage
            value: "{{ $env.STAGE }}"
          - name: TestType
            value: soak
        traces:
          serviceName: flex-api
          sampleRate: 1
          useRequestNames: true
          annotations:
            tool: Artillery
            stage: "{{ $env.STAGE }}"
            testType: soak